In [87]:
#Add the Pandas dependency
import pandas as pd

In [88]:
#Files to load
schoolData = "Resources/schools_complete.csv"
studentData = "Resources/students_complete.csv"

In [89]:
schoolDataDF = pd.read_csv(schoolData)
studentDataDF = pd.read_csv(studentData)
schoolDataDF.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [90]:
#Determines if there are missing values inside the schooldata file
schoolDataDF.count()

School ID      15
school_name    15
type           15
size           15
budget         15
dtype: int64

In [91]:
studentDataDF.count()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [92]:
#Determine if there are any missing values inside the student data
studentDataDF.isnull().sum()
studentDataDF.notnull().sum()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [93]:
#Determine data types for the school DataFrame
schoolDataDF.dtypes

School ID       int64
school_name    object
type           object
size            int64
budget          int64
dtype: object

In [94]:
schoolDataDF["budget"].dtype

dtype('int64')

In [95]:
prefixes_suffixes = ["Dr. ", "Mr. ","Ms. ","Mrs. ","Miss ", " MD"," DDS"," DVM", " PhD"]

for word in prefixes_suffixes:
    studentDataDF["student_name"] = studentDataDF["student_name"].str.replace(word,"")

In [96]:
studentDataDF.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [97]:
completeSchoolData = pd.merge(studentDataDF,schoolDataDF, on=["school_name","school_name"])
completeSchoolData.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [98]:
# Get the total number of students.
studentCount = completeSchoolData["Student ID"].count()
studentCount

39170

In [99]:
schoolCount = schoolDataDF["school_name"].count()
schoolCount

15

In [100]:
#Calculate the number of schools
schoolCount2 = completeSchoolData["school_name"].unique()
schoolCount2

array(['Huang High School', 'Figueroa High School', 'Shelton High School',
       'Hernandez High School', 'Griffin High School',
       'Wilson High School', 'Cabrera High School', 'Bailey High School',
       'Holden High School', 'Pena High School', 'Wright High School',
       'Rodriguez High School', 'Johnson High School', 'Ford High School',
       'Thomas High School'], dtype=object)

In [101]:
totalBudget = schoolDataDF["budget"].sum()
totalBudget

24649428

In [102]:
averageReadingScore = completeSchoolData["reading_score"].mean()
averageReadingScore

81.87784018381414

In [103]:
averageMathScore = completeSchoolData["math_score"].mean()
averageMathScore

78.98537145774827

In [104]:
passingMathScore = completeSchoolData["math_score"]>=70
passingReadingScore = completeSchoolData["reading_score"]>=70

In [105]:
passingMath = completeSchoolData[completeSchoolData["math_score"]>=70]
passingMath.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635

In [106]:
passingReading = completeSchoolData[completeSchoolData["reading_score"]>=70]
passingReading.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635

In [107]:
mathCount = passingMath["student_name"].count()
readingCount = passingReading["student_name"].count()
print(mathCount)
print(readingCount)

29370
33610

In [108]:
passingMath = passingMath["student_name"].count()/float(studentCount)*100
passingReading= passingReading["student_name"].count()/float(studentCount)*100
print(passingMath)
print(passingReading)

74.9808526933878
85.80546336482001

In [109]:
totalPassingPercent = completeSchoolData[(completeSchoolData["math_score"]>=70)&(completeSchoolData["reading_score"]>=70)]
totalPassingPercent.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635
9,9,Matthew Greene,M,10th,Huang High School,96,84,0,District,2917,1910635

In [110]:
totalPassingPercent["student_name"].count()

25528

In [111]:
totalPassingCount=totalPassingPercent["student_name"].count()
totalPassingCount

25528

In [112]:
totalPercentage = totalPassingPercent["student_name"].count()/float(studentCount)*100
totalPercentage

65.17232575950983

In [175]:
districtSummary = pd.DataFrame([{"Total Schools":schoolCount,"Total Students":studentCount,"Total Budget":totalBudget,
                                "Average Reading Score":averageReadingScore,"Average Math Score":averageMathScore,
                                 "%Passing Reading":passingReading,"%Passing Math":passingMath,
                                "OverallPassing%":totalPercentage}])
districtSummary

,Total Schools,Total Students,Total Budget,Average Reading Score,Average Math Score,%Passing Reading,%Passing Math,OverallPassing%
0,15,39170,24649428,81.87784,78.985371,85.805463,74.980853,65.172326

In [176]:
def passingMathPercent(passingStudents,totalStudents):
    return passingStudents/float(totalStudents)*100

In [177]:
passingMathCount = 29370
totalStudentCount = 39170
passingMathPercent(passingMathCount,totalStudentCount)

74.9808526933878

In [178]:
# Using the format() function.
my_grades = [92.34, 84.56, 86.78, 98.32]

for grade in my_grades:
    print("{:.0f}".format(grade))

92
85
87
98

In [179]:
myGrades = pd.Series([92.34, 84.56, 86.78, 98.32])
myGrades

0    92.34
1    84.56
2    86.78
3    98.32
dtype: float64

In [180]:
myGrades.map("{:.0f}".format)

0    92
1    85
2    87
3    98
dtype: object

In [181]:
districtSummary["Total Students"]=districtSummary["Total Students"].map("{:,}".format)
districtSummary["Total Students"]

0    39,170
Name: Total Students, dtype: object

In [182]:
districtSummary["Total Budget"] = districtSummary["Total Budget"].map("${:,.2f}".format)
districtSummary["Total Budget"]

0    $24,649,428.00
Name: Total Budget, dtype: object

In [183]:
districtSummary["Average Reading Score"] = districtSummary["Average Reading Score"].map("{:,.1f}".format)
districtSummary["Average Math Score"] = districtSummary["Average Math Score"].map("{:,.1f}".format)
districtSummary["%Passing Math"] = districtSummary["%Passing Math"].map("%{:,.0f}".format)
districtSummary["%Passing Reading"] = districtSummary["%Passing Reading"].map("%{:,.0f}".format)
districtSummary["OverallPassing%"] = districtSummary["OverallPassing%"].map("%{:,.0f}".format)

In [184]:
districtSummary

,Total Schools,Total Students,Total Budget,Average Reading Score,Average Math Score,%Passing Reading,%Passing Math,OverallPassing%
0,15,"39,170","$24,649,428.00",81.9,79.0,%86,%75,%65

In [187]:
newColumnOrder = ["Total Schools","Total Students","Total Budget","Average Math Score","%Passing Reading","Passing Math","OverallPassing%"]
districtSummary =